michalharakal/arduino-clones/hardware/wiga/bootloaders/retrointerfacing/ATmegaBOOT_32.c
		    }
		    /* end of monitor functions */

		}
	    }
	}
	/* end of monitor */
#endif
	else if (++error_count == MAX_ERROR_COUNT) {
	    app_start();
	}
    }
    /* end of forever loop */

}


char gethex(void) {
    char ah,al;

    ah = getch(); putch(ah);
    al = getch(); putch(al);
    if(ah >= 'a') {
	ah = ah - 'a' + 0x0a;
    } else if(ah >= '0') {
	ah -= '0';
    }
    if(al >= 'a') {
	al = al - 'a' + 0x0a;
    } else if(al >= '0') {
	al -= '0';
    }
    return (ah << 4) + al;
}


void puthex(char ch) {
    char ah,al;

    ah = (ch & 0xf0) >> 4;
    if(ah >= 0x0a) {
	ah = ah - 0x0a + 'a';
    } else {
	ah += '0';
    }
    al = (ch & 0x0f);
    if(al >= 0x0a) {
	al = al - 0x0a + 'a';
    } else {
	al += '0';
    }
    putch(ah);
    putch(al);
}


void putch(char ch)
{
	while (!(UART_STATUS & (1<<UART_TXREADY)));
	UART_DATA = ch;
}


char getch(void)
{
  uint32_t count = 0;
	while (!(UART_STATUS & (1<<UART_RXREADY)));
  while(!(UCSRA & _BV(RXC))){
    	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/               
    	/* HACKME:: here is a good place to count times*/
    	count++;
    	if (count > MAX_TIME_COUNT)
    		app_start();
     }
	return UART_DATA;
}


void getNch(uint8_t count)
{
    uint8_t i;
    for(i=0;i<count;i++) {
    	getch(); // need to handle time out
    }
}


void byte_response(uint8_t val)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(val);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}


void nothing_response(void)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}

void flash_led(uint8_t count)
{
    /* flash onboard LED three times to signal entering of bootloader */
	/* l needs to be volatile or the delay loops below might get
	optimized away if compiling with optimizations (DAM). */
    volatile uint32_t l;

    if (count == 0) {
      count = 3;
    }
    
    for (i = 0; i < count; ++i) {
	LED_PORT |= _BV(LED);
	for(l = 0; l < (F_CPU / 1000); ++l);
	LED_PORT &= ~_BV(LED);
	for(l = 0; l < (F_CPU / 1000); ++l);
    }
}


/* end of file ATmegaBOOT.c */
